zhangzhen2618/code_learning/CC2530/__common/cc2530io_bitdef.h
#define ENCCS_CMD_ENC                     (0x00 << 1)
#define ENCCS_CMD_DEC                     (0x01 << 1)
#define ENCCS_CMD_LDKEY                   (0x02 << 1)
#define ENCCS_CMD_LDIV                    (0x03 << 1)


// ENCDI (0xB1) - Encryption Input Data

// ENCDO (0xB2) - Encryption Output Data


/*******************************************************************************
 * Watchdog Timer
 */

// WDCTL (0xC9) - Watchdog Timer Control
#define WDCTL_CLR                         0xF0
#define WDCTL_CLR0                        0x10
#define WDCTL_CLR1                        0x20
#define WDCTL_CLR2                        0x40
#define WDCTL_CLR3                        0x80
#define WDCTL_EN                          0x08
#define WDCTL_MODE                        0x04
#define WDCTL_INT                         0x03
#define WDCTL_INT0                        0x01
#define WDCTL_INT1                        0x02


#define WDCTL_INT_SEC_1                   (0x00)
#define WDCTL_INT1_MSEC_250               (0x01)
#define WDCTL_INT2_MSEC_15                (0x02)
#define WDCTL_INT3_MSEC_2                 (0x03)



/*******************************************************************************
 * USART
 */

// U0CSR (0x86) - USART 0 Control and Status

#define U0CSR_MODE                        0x80
#define U0CSR_RE                          0x40
#define U0CSR_SLAVE                       0x20
#define U0CSR_FE                          0x10
#define U0CSR_ERR                         0x08
#define U0CSR_RX_BYTE                     0x04
#define U0CSR_TX_BYTE                     0x02
#define U0CSR_ACTIVE                      0x01


// U0UCR (0xC4) - USART 0 UART Control
#define U0UCR_FLUSH                       0x80
#define U0UCR_FLOW                        0x40
#define U0UCR_D9                          0x20
#define U0UCR_BIT9                        0x10
#define U0UCR_PARITY                      0x08
#define U0UCR_SPB                         0x04
#define U0UCR_STOP                        0x02
#define U0UCR_START                       0x01


// U0GCR (0xC5) - USART 0 Generic Control
#define U0GCR_CPOL                        0x80
#define U0GCR_CPHA                        0x40
#define U0GCR_ORDER                       0x20
#define U0GCR_BAUD_E                      0x1F
#define U0GCR_BAUD_E0                     0x01
#define U0GCR_BAUD_E1                     0x02
#define U0GCR_BAUD_E2                     0x04
#define U0GCR_BAUD_E3                     0x08
#define U0GCR_BAUD_E4                     0x10


// U0DBUF (0xC1) - USART 0 Receive/Transmit Data Buffer

// U0BAUD (0xC2) - USART 0 Baud Rate Control

// U1CSR (0xF8) - USART 1 Control and Status - bit accessible SFR register
#define U1CSR_MODE                        0x80
#define U1CSR_RE                          0x40
#define U1CSR_SLAVE                       0x20
#define U1CSR_FE                          0x10
#define U1CSR_ERR                         0x08
#define U1CSR_RX_BYTE                     0x04
#define U1CSR_TX_BYTE                     0x02
#define U1CSR_ACTIVE                      0x01


// U1UCR (0xFB) - USART 1 UART Control
#define U1UCR_FLUSH                       0x80
#define U1UCR_FLOW                        0x40
#define U1UCR_D9                          0x20
#define U1UCR_BIT9                        0x10
#define U1UCR_PARITY                      0x08
#define U1UCR_SPB                         0x04
#define U1UCR_STOP                        0x02
#define U1UCR_START                       0x01


// U1GCR (0xFC) - USART 1 Generic Control
#define U1GCR_CPOL                        0x80
#define U1GCR_CPHA                        0x40
#define U1GCR_ORDER                       0x20
#define U1GCR_BAUD_E                      0x1F
#define U1GCR_BAUD_E0                     0x01
#define U1GCR_BAUD_E1                     0x02
#define U1GCR_BAUD_E2                     0x04
#define U1GCR_BAUD_E3                     0x08
#define U1GCR_BAUD_E4                     0x10


// U1DBUF (0xF9) - USART 1 Receive/Transmit Data Buffer

// U1BAUD (0xFA) - USART 1 Baud Rate Control


/*******************************************************************************
 * I2S
 */

// 0xDF40: I2SCFG0 - I2S Configuration Register 0
#define I2SCFG0_TXIEN                     0x80
#define I2SCFG0_RXIEN                     0x40
#define I2SCFG0_ULAWE                     0x20
#define I2SCFG0_ULAWC                     0x10
#define I2SCFG0_TXMONO                    0x08
#define I2SCFG0_RXMONO                    0x04
#define I2SCFG0_MASTER                    0x02
#define I2SCFG0_ENAB                      0x01


// 0xDF41: I2SCFG1 - I2S Configuration Register 1
#define I2SCFG1_WORDS                     0xF8
#define I2SCFG1_WORDS0                    0x08
#define I2SCFG1_WORDS1                    0x10
#define I2SCFG1_WORDS2                    0x20
#define I2SCFG1_WORDS3                    0x40
#define I2SCFG1_WORDS4                    0x80
#define I2SCFG1_TRIGNUM                   0x06
#define I2SCFG1_TRIGNUM0                  0x02
#define I2SCFG1_TRIGNUM1                  0x04
#define I2SCFG1_IOLOC                     0x01

#define I2SCFG1_TRIGNUM_NO_TRIG           (0x00 << 1)
#define I2SCFG1_TRIGNUM_USB_SOF           (0x01 << 1)
#define I2SCFG1_TRIGNUM_IOC_1             (0x02 << 1)
#define I2SCFG1_TRIGNUM_T1_CH0            (0x03 << 1)



// 0xDF42: I2SDATL - I2S Data Low Byte

// 0xDF43: I2SDATH - I2S Data High Byte

// 0xDF44: I2SWCNT - I2S Word Count Register

// 0xDF45: I2SSTAT - I2S Status Register
#define I2SSTAT_TXUNF                     0x80
#define I2SSTAT_RXOVF                     0x40
#define I2SSTAT_TXLR                      0x20
#define I2SSTAT_RXLR                      0x10
#define I2SSTAT_TXIRQ                     0x08
#define I2SSTAT_RXIRQ                     0x04
#define I2SSTAT_WCNT                      0x03
#define I2SSTAT_WCNT0                     0x01
#define I2SSTAT_WCNT1                     0x02

#define I2SSTAT_WCNT_10BIT                (0x02)
#define I2SSTAT_WCNT_9BIT                 (0x01)
#define I2SSTAT_WCNT_9_10BIT              (0x02)


#endif // !